[{"questionAnswers":[],"id":"680939","title":"Opening keynote","description":"* Overview of the state of Flutter\r\n* How Generative AI will likely inform Flutter's future\r\n* How the Flutter community can be a part of that change.\r\n* Flutter's impact at large companies, and how we can create more opportunities for Flutter devs to have the careers they want.","startsAt":"2024-07-03T09:00:00","endsAt":"2024-07-03T10:00:00","isServiceSession":false,"isPlenumSession":true,"speakers":[{"id":"d8307021-3c1b-4739-9ccc-d4223501ba6a","name":"Andrew Brogdon"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240327,"name":"Keynote"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"653812","title":"Modular Flutter App Architecture: Answering the What, When and How","description":"As Flutter apps grow in complexity, adopting a modular architecture becomes a critical practice to manage codebases and enable efficient feature development. It brings better code organization, team independence for feature development and testing, and separation of concerns.\r\n\r\nFor Flutter applications, there are times to follow modular application architecture and times to avoid it. In this talk, we will explore what modular architecture means for Flutter, when to implement it in your apps and when not to, and how to structure your code into logical modules with concrete strategies and examples by dividing code into feature, layer, and core modules. Last but not least, you will learn best practices for module communication, state management across modules, and module-specific testing.","startsAt":"2024-07-03T10:20:00","endsAt":"2024-07-03T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"adadf66f-529c-48fd-ba12-94903187a216","name":"Salih Guler"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"651318","title":"Cat-like Development: Flutter for Efficiency","description":"Many developers chase the dream of being a \"unicorn\" - an individual who seamlessly wields the power to design, build, and deliver remarkable products. But what if you are more like a cat? A person, who wants to invest the least amount of effort for the maximum outcome. In this talk, we'll explore how Flutter empowers developers to do exactly that.\r\n\r\nThe main topics covered in this talk:\r\n1) Flutter animations.\r\n2) Architectural decisions for seamless performance.\r\n3) Using Dart and Flutter packages for efficiency.\r\n4) App reviews, user feedback and other product-centric tips.\r\n5) ... and more!\r\n\r\nBy the end of this session, you will learn multiple practical tips and tricks that will help you create great products and stunning, interactive interfaces with minimal effort.","startsAt":"2024-07-03T10:20:00","endsAt":"2024-07-03T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"bc85c606-71d3-47f3-ae17-314f07d67836","name":"Mangirdas Kazlauskas"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"635841","title":"Zero runtime errors: Exploring Static Code Analysis techniques in Flutter","description":"If you ask a developer whether they would prefer to fix a bug or develop a new feature, there is no doubt they will select the latter.\r\n\r\nUnfortunately, bugs are part of the development cycle and are inevitable.\r\n\r\nFortunately, there are techniques to predict and prevent them, even without running the code: with the help of static code analysis.\r\n\r\nStatic code analysis is a powerful tool for finding and fixing potential errors even before compiling your code, making the cycle much faster and developers more productive. Moreover, the flexibility of this tool allows you to configure it in a way to not only control bugs but also code style and specific team practices.\r\n\r\nIn this talk, we will do a deep dive into the world of static code analysis, exploring strategies on how to set it up to work best in your project, possibilities beyond `flutter_lints`, such as other libraries and 3rd party services like Dart Code Metrics, as well as what it takes to create your own custom lints for your library or app with tools such as `custom_lint`. By the end of this talk, you will be fully equipped to set up a robust static analysis system in your project and make your projects more reliable, consistent, and performant.","startsAt":"2024-07-03T10:20:00","endsAt":"2024-07-03T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1c281aa7-145a-49f2-b9f4-96481e515c1c","name":"Daria Orlova"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"695391","title":"Realtime Communications with Flutter","description":"Have you been finding the limitations with Firebase/Firestore in your Flutter projects? Here is a solution that might be for you!\r\n\r\nWhat if I told you that you could  switch from Firestore to Pure Dart and still achieve your project goals?\r\n\r\nIn this session learn how to write a backend in Dart and have it communicate in real-time with your users on Mobile/Desktop/Web and Embedded using Flutter!","startsAt":"2024-07-03T10:20:00","endsAt":"2024-07-03T11:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"bc346296-9555-45d1-abde-8a05a51121c7","name":"Simon Lightfoot"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"634109","title":"Native Background Processing with Flutter","description":"Background processing tends to be one of the afterthoughts with Flutter apps, and I would love to change that. There are several ways to achieve it with Flutter or Dart, although some of them involve a bit of native platform understanding with a pinch of Kotlin or Swift. In this talk I’ll show you how to make it all work without losing your mind, even if you don't have any Android or iOS experience.\r\n\r\nThis talk covers both iOS and Android background processing, with and without utilizing existing Flutter plugins. We'll try to look into desktop background processing as well.","startsAt":"2024-07-03T11:15:00","endsAt":"2024-07-03T11:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"29ba7916-20b4-48e5-9715-bddfbdd1aa3a","name":"Dominik Roszkowski"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678135","title":"Listen up! Mastering A/B testing and feedback techniques in your mobile apps","description":"In the world of mobile app development, truly understanding and catering to your users' needs can be the difference between an app that thrives and one that just survives. In this talk, we'll focus on how to effectively gather and use feedback from users within Flutter apps, turning it from an overlooked aspect to a core part of your development process.\r\n\r\nWe'll start by exploring a variety of ways to ask for feedback. We'll look at gentle, almost unnoticed prompts within the app, as well as more straightforward methods.\r\n\r\nBut gathering feedback is just the beginning. Next, we'll take a deep dive into A/B testing. This is a powerful tool that can help you understand what your users prefer and how they behave. I will show you how to set up effective tests, interpret the results, and use this information to make decisions about your app.\r\n\r\nBy the end of this talk, you'll have a better understanding of how to listen to your users and use their feedback to improve your app. You'll learn how to build Flutter apps that are shaped by your users' needs and wants, rather than just your initial ideas. This user-focused approach will help you create apps that your users love and keep coming back to. So, let's start listening to our users and making apps that truly meet their needs!","startsAt":"2024-07-03T11:15:00","endsAt":"2024-07-03T11:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d63cf645-9a0e-434b-bebe-4a3825755cb5","name":"Alicja Ogonowska"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"636042","title":"Showing that you care about security - OpenSSF Scorecards for Dart and Flutter projects","description":"Have you noticed the OpenSSF Scorecard badges on the official Dart and Flutter repos? It's Google's way of showing that they care about security. Practices such as pinning dependencies, branch protection, required reviews, continuous integration tests etc. are measured to provide a score and accompanying badge.\r\n\r\nYou can do the same for your projects, and this presentation will show you how, with an emphasis on the unique challenges that come up when working with Dart and Flutter.\r\n\r\nThe session will provide a walkthrough of the steps involved in securing a first repository, and then what it takes to repeat that process across an organization with multiple repos. It will also look at the ongoing maintenance involved once scorecards have been implemented, and how aspects of that maintenance can be better automated to minimize toil.","startsAt":"2024-07-03T11:15:00","endsAt":"2024-07-03T11:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"27310ceb-01d4-42b6-ae97-5dbca301b6b8","name":"Chris Swan"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"632222","title":"Workshop: Flutter for Android TV and Apple TV","description":"Get ready to explore TV app development using Flutter. While Flutter officially supports various platforms, TV platforms like Android TV and Apple TV have been overlooked. But fear not! In this workshop, we'll show you how to bring your Flutter apps to the big screen.\r\n\r\nIn this workshop, we will go through all the steps of porting your mobile app to the big screen, discuss all the nuances of TV apps, such as controlling the app with a remote control, and finally launch the app on a TV platform, not only on Android TV, but also on Apple TV","startsAt":"2024-07-03T11:15:00","endsAt":"2024-07-03T12:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"c73c2377-026f-4b6a-b1f7-91a536c33c67","name":"Sasha Denisov"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240325,"name":"Workshop"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"676869","title":"Navigation in Flutter - the not-so-obvious parts","description":"Navigation between screens is an inseparable part of Flutter app development. However, such a fundamental thing is not so simple once you move beyond the absolute basics. You have the imperative Navigator 1.0 and declarative Navigator 2.0. Many different packages provide their own implementation and flavor to the declarative navigator - which one to choose? How to deal with, for example, nested routes? In this talk, you’re going to learn best practices and tips on how to navigate the vast world of navigation in Flutter.","startsAt":"2024-07-03T12:10:00","endsAt":"2024-07-03T12:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"a9ffacf1-5521-4083-a997-e8d86290a4d8","name":"Matej Rešetár"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"649779","title":"How I get your location: A story of permissions","description":"In many mobile applications, it is essential to track the user's location in order to provide a unique and personalised experience. However, gaining access to this sensitive information requires explicit permissions, especially when the goal is to track user locations even when the application is not actively running.\r\n\r\nThis was the challenge I faced when working on my geofencing integration project, and I must admit that my initial expectations were not met. What I thought I could do in one day turned out to be a much more complicated task.\r\n\r\nHere are some of the topics I will cover during the talk:\r\n\r\n- An exploration of different types of permissions and best practices for requesting them\r\n- How to ask for foreground location permission with clean cross-platform code\r\n- How to ask for background permissions with clean cross-platform code\r\n- A discussion of Flutter's limitations when it comes to requesting such permissions\r\n\r\nIn the end, you will be able to access your users' location no matter what the circumstances - or at least be able to ask for it.","startsAt":"2024-07-03T12:10:00","endsAt":"2024-07-03T12:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b6660351-1a00-4a10-97c3-1e5d05db2d5a","name":"Thomas Coumau"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"655739","title":"Motion Designer is your best friend for creating animations","description":"Animation is a powerful tool to convey messages, evoke emotions, and send feedback on a user's action. Every detail of a good animation is well thought out and makes sense. A motion designer cares about it. Our task as developers is not to miss these details and implement exactly what our colleague has created. In this talk, I will share how we at Wolt approach this problem using motion specifications and Flutter.","startsAt":"2024-07-03T12:10:00","endsAt":"2024-07-03T12:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"381de07f-cf8f-483e-866e-5bce9650bf55","name":"Mikhail Zotyev"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"681438","title":"Flutter Engineering","description":"Unlock Flutter's full potential with insights from 'Flutter Engineering.' Join me to explore advanced architectural patterns and optimization techniques. Enhance your Flutter development skills and master the engineering principles behind building robust, scalable applications. This session is perfect for intermediate to advanced developers looking to deepen their understanding and elevate their app development.","startsAt":"2024-07-03T13:40:00","endsAt":"2024-07-03T14:20:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"36aaec31-fde9-427c-bd04-3a7ceecbab0b","name":"Majid Hajian"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"650611","title":"Animation vs delivery, do you really have to choose ?","description":"We love Flutter, primarily because of its seamless and captivating animations. These animations don't just add visual appeal—they instil identity and authenticity into an application. Yet, persuading stakeholders or even fellow team members of their worth can be challenging. Mainly because we couldn't always estimate precisely how long a particular animation would take to implement.\r\n\r\nWith this in mind, we decided to dive deep. We wanted to understand Flutter animations inside out and make them efficient, without wasting hours.\r\n\r\nFor over a year now, we (Thomas and Maxime) have led company-wide Flutter animation challenges called “UI & Animations Dojos”. Our objective? To collaboratively enhance our skills and guide fellow developers in seamlessly integrating animations.\r\n\r\nHere are some of the topics we’ll tackle during the talk:\r\n\r\n- The different ways to animate Flutter recommends and how to use them in real life cases.\r\n- How to figure out if adding that fancy animation is going to blow your project timeline.\r\n- Tips to code animations faster and smarter based on a live coding session.\r\n- By the end, you'll gain a better grasp on estimating the time required to implement a specific animation, aiding in prioritising what's most essential for your application.","startsAt":"2024-07-03T13:40:00","endsAt":"2024-07-03T14:20:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b6660351-1a00-4a10-97c3-1e5d05db2d5a","name":"Thomas Coumau"},{"id":"2b17f609-a458-404e-a71c-7055a6433bb3","name":"Maxime Rougieux"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680024","title":"Dash’s Inclusive Adventure - Experimenting with Accessibility in Flutter Games","description":"With Flutter we have a great tool to create games that can be enjoyed by our users. Now is the time to also talk about how to make games inclusive.\r\nLet's walk through my experiment of making my game \"Dash’s adventure\" inclusive, meaning thinking of people with various disabilities and creating a game that is enjoyable by everyone.\r\nWe will check what is possible and what is currently done by the bigger gaming studios to make games accessible. We will talk about accessibility guidelines in gaming and their different levels of accessibility.\r\nFurthermore, we are going to check how to implement some of the talked about accessibility guidelines in Flutter. ","startsAt":"2024-07-03T13:40:00","endsAt":"2024-07-03T14:20:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8e7913b6-fce4-419a-b862-7a1b535d1af9","name":"Manuela Sakura Rommel"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677654","title":"Please wait... : The perception of time in user Interfaces","description":"Waiting is an essential part of everything: sometimes things just take a while. Apps are no different, the network and other factors are causing unevitable delays, resulting in a waiting user. In this talk, we have a look at the perception of time and identify what a delay is made of. On the technical side, we learn how to creatively use Flutter widgets and futures to improve the user's experience, working with his expectation and (im)patience. ","startsAt":"2024-07-03T13:40:00","endsAt":"2024-07-03T14:20:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"3d19b5bf-354f-4cc4-b93a-2caf0c7e26f3","name":"André Schmidt Di Salvo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677594","title":"Bringing Google Maps to Flutter: The Power of Plugins","description":"Flutter allows developing high-quality apps for multiple platforms (Android, iOS, Web, and more) from a single code base. But some app functionality depends on platform-specific APIs, a requirement seemingly at odds with “one codebase for all platforms”. To bridge this gap, Flutter defines the concept of Plugins to access native apis from cross-platform code.\r\nIn this talk I will build a simple Flutter app that displays a map, looks up an address (geo-coding), and plots a route (directions) with the help of two existing Flutter plugins. Both are cross-platform but under the hood make use of platform specific APIs, combining multiple platform specific solutions into a single developer friendly package. \r\nAfter showing how to use the Google Maps and geocoding packages in my app, I will dissect the basic structure of the two plugins and discuss how a developer might extend them, for example by adding support for a new platform. ","startsAt":"2024-07-03T14:35:00","endsAt":"2024-07-03T15:15:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"56adf989-f244-4fad-84b8-e91ddfdaa899","name":"Sylvia Dieckmann"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680610","title":"Building with best practices in FlutterFlow","description":"In this session, we'll walk through an overview of FlutterFlow. We'll start with the product mission, talk through the architecture of a FlutterFlow app, walk through the generated code, and talk through best practices when building in FlutterFlow. \r\n\r\nYou'll walk away from this session with a better understanding of how FlutterFlow generates Flutter code, and how you can leverage new FlutterFlow features.","startsAt":"2024-07-03T14:35:00","endsAt":"2024-07-03T15:15:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b87f2bbc-a848-4633-ad97-79a3106e66be","name":"Leigha Reid"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"676988","title":"Simplify Design Systems and Designer/Developer Collaboration with Widgetbook","description":"Abstract:\r\nCreating beautiful UI has never been easier with Flutter. However, managing and organizing widgets effectively can pose challenges for developers, particularly when it comes to organizing them, testing them in all their different use cases, and maintaining design-code consistency. This is where Widgetbook comes in.\r\n\r\nIn this talk, we will see examples of Flutter companies benefiting from Widgetbook. You can use the open-source Flutter package Widgetbook to build your own design system/widget library. By using the CI/CD integration with Widgetbook Cloud, you can automatically test your widgets across different devices, themes, and languages (managed Golden Tests). In addition, you can connect your Figma designs directly to our Flutter widgets which simplifies the review process with designers. Thereby, you will keep design and code in sync.\r\n\r\nKey takeaways:\r\n\r\n- How to build your own design system / widget library\r\n- How to automatically test your widgets on different device sizes, themes, languages, etc.\r\n- How to use Golden Tests without limitations\r\n- How to collaborate effectively with designers and product managers to keep design and code sync\r\n- How to use Widgetbook in your processes by seeing real-life examples from existing Widgetbook users","startsAt":"2024-07-03T14:35:00","endsAt":"2024-07-03T15:15:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8940b938-d09f-4a9b-bfbb-e3c9ad6cefa8","name":"Lucas Josefiak"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"653934","title":"One Size Doesn't Fit All: Tailoring Flutter Architectures for Team and Business Success","description":"In the fast-paced world of startups, idealism often needs to adapt.\r\nJoining a small team, I faced the challenge of balancing long-term architecture with immediate business needs.\r\nWe embraced a pragmatic approach, prioritizing features while gradually refactoring when possible.\r\nThis meant shared responsibility for testing and maintaining code. While not ideal, it fostered flexibility and helped us create a \"good enough\" workflow for our unique environment.\r\nThis experience taught me the importance of tailoring development strategies to team strengths and project realities.\r\n\r\nI would like to share with you the takeaways for the project and key concepts that you should be aware of when scheduling long term, large scale refactor of the app.","startsAt":"2024-07-03T14:35:00","endsAt":"2024-07-03T15:15:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"dc48e427-fa2a-4adb-a157-416de03b71d3","name":"Jan Stępień"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"648063","title":"Saving data before the app getting killed! Easy state restoration with Flutter","description":"Imagine this scenario as a user: You are writing a long text in an app, keep switching between various apps, and return to the app, but notice the OS killed it! Now, all your written text is gone. What a terrible UX! How can we, as developers, help the user avoid running into this worst-case scenario? Simply keep and restore the app’s state! We always discuss state management but forget about restoration. For my newest app, \"Japanana,\" I needed to include this feature. So, I will explain the implementation with an actual example. In this talk, I want to:\r\n\r\n- Show how to enable state restoration\r\n- Explain the differences between iOS and Android\r\n- Implement the restoration of our app state and discuss various strategies including navigation\r\n- Learn about multiple possibly unheard types such as RestorableInt and RestorableString\r\n- Adjust our tests with this new behaviour\r\n","startsAt":"2024-07-03T15:45:00","endsAt":"2024-07-03T16:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"aaf92f23-297d-4723-93e1-c1291c2173e8","name":"Lucas Goldner"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680035","title":"Experimenting with Modifier: embracing Compose-inspired UI in Flutter","description":"Discover how Flutter developers can apply the Modifier concept, inspired by Jetpack Compose, to change approach to UI composition. Explore the simplification of traditional widget-based layouts to a Modifier based composable approach using custom widgets.\r\n\r\n- Introduction to Modifier: overview of the Modifier concept as popularised by Jetpack Compose. Adapting Compose-inspired techniques for Flutter UI development.\r\n- Advantages of Modifier-Based UI: discuss the benefits of using a Modifier system for building UIs. Comparison with traditional approaches in Flutter.\r\n- Understanding Dart Modifier: defining custom Modifier object in Flutter world. Exploring the role of Modifier in enhancing UI flexibility and readability.\r\n- Replacing traditional Widgets with Modifier: demonstrating how Modifier can replace Padding, Container, and other common widgets. Building layouts using Modifier chains for concise and efficient code.\r\n\r\nKey Takeaways:\r\nAttendees will gain actionable insights into adopting Modifier widget approach within Flutter, empowering them to build more maintainable, composable, and efficient UIs inspired by modern UI frameworks like Jetpack Compose.","startsAt":"2024-07-03T15:45:00","endsAt":"2024-07-03T16:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"606a1cb6-edd2-42bd-8bd4-08a51ef41c7f","name":"Vadym Pinchuk"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680848","title":"Testing that your app is accessible to all","description":"Apps are great when they're accessible to all. But how can a developer make sure their app is accessible? Here come accessibility guidelines and accessibility tools. This talk is about using these guidelines in widget tests and using these tools to ensure your app works fine in various environments","startsAt":"2024-07-03T15:45:00","endsAt":"2024-07-03T16:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"fe7c7b63-278f-4d5c-9518-07a3ef4a0a7c","name":"Alexander Troshkov"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"665893","title":"Code Quality Gates for Large-Scale Flutter Apps","description":"I'll share insights on guidelines and tools to maintain the quality of a Flutter app.\r\n\r\nThe talk will cover code quality aspects: \r\n- structural, like code reviews and various static code analysis techniques including architecture tests\r\n- functional, such as automated testing.\r\n\r\nCode quality is important for projects of any size, but it's crucial for large-scale ones where tens of Flutter developers may work for years.","startsAt":"2024-07-03T15:45:00","endsAt":"2024-07-03T16:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1e50e236-5c34-4d09-9b11-60c76cab4592","name":"Pavel Sulimau"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"634639","title":"Ubuntu: An OS experience built on Flutter","description":"Did you know that more and more of the user experience in Ubuntu is built on Flutter? All new front-end applications developed for Ubuntu are using Flutter and currently the OS installer, app center, firmware updater, music player and more are already developed in Flutter.\r\n\r\nIn this talk you'll learn about:\r\n* Why Canonical and Ubuntu chose Flutter as their go to framework for applications\r\n* What the differences are when developing only for Linux\r\n* What challenges we have had and how we overcome them while developing these applications\r\n* How you can be part of developing Flutter apps in the open source world that millions of people will use","startsAt":"2024-07-03T16:20:00","endsAt":"2024-07-03T17:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"4b930be4-dd6a-409c-8576-b0628cf87f62","name":"Lukas Klingsbo 💙"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679362","title":"Compilers, Virtual Machines and Code Analysis - What makes Dart and Flutter run","description":"This advanced session takes a look at what powers Flutter under the hood. This will include everything but the typical code you write day to day.\r\n\r\nKey topics:\r\n\r\n- The Dart compiler\r\n- The DartVM\r\n- The Dart Analyzer\r\n- The Engine\r\n\r\nEach topic will consist of some high-level overview & fun examples of things you can do.\r\n\r\nAfter the talk, you should have gained a general understanding of how Flutter and Dart work under the hood and be equipped with basic knowledge to start building tools for the Dart and Flutter ecosystem.","startsAt":"2024-07-03T16:20:00","endsAt":"2024-07-03T17:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"54e42130-4a09-4ec0-a58d-d52b18014ec2","name":"Norbert Kozsir"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677004","title":"Lessons Learned from Launching a Flutter app in Production","description":"- How to use a GitHub repo as a free data source for Markdown content (plus considerations around API key management)\r\n- From Markdown to Flutter UI: Markdown pre-processing with Regex and styling (with some help from AI)\r\n- Offline mode and caching with Drift & Riverpod\r\n- The importance of monitoring a production app with tools like Sentry, Mixpanel, and Firebase Analytics\r\n- Continuous improvement: choosing KPIs, fixing production bugs, acting on user feedback, etc.","startsAt":"2024-07-03T16:20:00","endsAt":"2024-07-03T17:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1fef9768-66f6-4f28-b33d-6c781a4561c5","name":"Andrea Bizzotto"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"654639","title":"M&Ms Your Way: Build a Fun, Flutter-Powered Candy Dispenser (with Live Treats!) on Raspberry Pi 5","description":"Tired of boring M&M mixes? Take control with Flutter! This talk dives into building a custom M&M dispenser you control with code, powered by the mighty Raspberry Pi 5.\r\n\r\nWe'll ditch the screens and get our hands dirty (well, maybe not that dirty) as we:\r\n\r\n– Craft a sweet user interface to pick your perfect M&M color combo.\r\n– Unlock the secrets of connecting Flutter to real-world hardware (cue the M&M rain!).\r\n– Learn how to make your own interactive Flutter projects beyond the phone, leveraging the power of Raspberry Pi 5.\r\n\r\nGet ready for a sugar rush of knowledge (and maybe some real M&Ms)! This session features a live demo of the M&M dispenser on stage, so you can create your own custom mix.\r\n\r\nCalling all curious coders! This talk is perfect if you want to see Flutter in action on Raspberry Pi 5 and build something fun - with a delicious reward.","startsAt":"2024-07-03T16:20:00","endsAt":"2024-07-03T17:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"e6858863-4e16-44ab-b2e0-22c940533654","name":"Moritz Theis"},{"id":"235d24fc-f88f-49b5-959f-71e5cd45849b","name":"Payam Zahedi"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"637122","title":"Debugging performance issues with the Flutter DevTools","description":"I've built a dummy app with several performance issues from real life examples. Through live-coding, let’s fix those issues together, leveraging the power of the performance view in the DevTools. \r\nAs an added bonus, I will present a neat way to establish a performance indicator, to easily evaluate the impact of our changes.","startsAt":"2024-07-03T17:20:00","endsAt":"2024-07-03T18:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"ae4dc258-34a6-462c-b778-807da7d25de4","name":"Alexandre Moureaux"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"674646","title":"Monitor your Flutter app and see every issue!","description":"Error and performance monitoring is essential for assessing your application's health while in use by customers. After this talk, you'll gain the skills to analyze various production issues effectively and swiftly. This includes application crashes up to general system sluggishness.\r\n\r\nThe first part aims to teach you a fundamental understanding of error monitoring. Starting with the obvious question of \"What is error monitoring, and why do I need it?\" all the way to \"Which hooks do I need to use to observe uncaught exceptions?\".\r\nAdditionally, we'll explore what makes exceptions actionable and useful, so that you're able to fix them in no time.\r\n\r\nIn the second half of the talk, I'm going to explain the fundamental concepts of performance monitoring,\r\nand how it differs from error monitoring. \r\nBased on an example with Flutter for the app and dart_frog for the backend, we'll explore how to trace performance across the network boundary to identify and fix general system sluggishness.","startsAt":"2024-07-03T17:20:00","endsAt":"2024-07-03T18:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"47b77a47-3baf-47f8-81a5-caf07258ea0b","name":"Jonas Uekötter"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678397","title":"Seal the Pact: Consumer-Driven Contract Testing in Flutter.","description":"In this presentation, we will talk about:\r\n- Contract Testing: an automated testing approach that runs at the speed of widget tests and has the accuracy of integration tests.\r\n- Creating a solid testing infrastructure for you application with Pact.\r\n- How Consumer-Driven contract testing can help you insure that your backend API is always a perfect fit for your Flutter app.\r\n- How contract testing can reduce feedback loops between frontend and backend teams working on the same product.","startsAt":"2024-07-03T17:20:00","endsAt":"2024-07-03T18:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"72e3ada9-84e7-4a9d-9aeb-e3c0ca24eb66","name":"Boris Kayiranga"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"671971","title":"Adding HomeScreenWidgets to your Flutter App","description":"After iOS 17 introduced Interactive Widgets, HomeScreen Widgets have become increasingly popular. In this talk, we will explore what HomeScreen Widgets are and the benefits they can bring to your users and your product. Most importantly, the session will cover all the necessary steps to add them to your Flutter apps on iOS and Android using home_widget.","startsAt":"2024-07-03T17:20:00","endsAt":"2024-07-03T18:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"9623a9d9-b47d-4c24-b8cd-ff809e53faf0","name":"Anton Borries"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677708","title":"Enhance your Flutter painting skills","description":"When it comes to draw raw pixels, we can call the CustomPaint widget to save us! I bet it already saved you in your Flutter journey, but did you used the whole potential of the Canvas object?\r\n\r\nIn this talk, we'll see some specific methods of the Canvas class and how they can make your app more performant and your life easier.","startsAt":"2024-07-04T09:20:00","endsAt":"2024-07-04T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"76117eec-d3f7-49c7-9684-c19058f241a0","name":"Romain Rastel"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"696700","title":"Android Platform Views Past, Present, Future","description":"Deep dive on how Android Platform Views are implemented","startsAt":"2024-07-04T09:20:00","endsAt":"2024-07-04T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"7d024144-e347-41e7-aae5-f9e2c79024b6","name":"John McCutchan"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677890","title":"Elevating JavaScript interoperability with Dart","description":"Embark on a journey into Dart's cutting-edge JavaScript\r\ninteroperability!\r\nExplore the groundbreaking dart:js_interop library, unveiling a new typed API for seamless JavaScript interaction. Learn about extension types for representing JavaScript types in Dart. Dive deeper into the intriguing package:web and its connection to WebAssembly. Join us for an enlightening exploration!","startsAt":"2024-07-04T09:20:00","endsAt":"2024-07-04T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"c4ac8d21-2197-4671-ba39-5667d06d95dc","name":"Jaime Blasco"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"635387","title":"Dart on the backend with Serverpod: Building interactive slides for tech talks","description":"Is this the most meta talk you have attended? A presentation about making presentations.\r\n\r\nServerpod is an open-source backend for Flutter written in Dart that is quickly gaining traction. We take a deep dive into a real-world app built with Flutter and Serverpod. You will not only learn how to handle real-time communication but also how to create stunning interactive presentations for your tech talks. Attending the talk will teach you how to use Dart on the backend effectively, all the way from starting a new project to deploying it to the cloud.","startsAt":"2024-07-04T09:20:00","endsAt":"2024-07-04T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8417b01b-bfdd-437f-9c65-821041c06c1e","name":"Viktor Lidholt"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677728","title":"Your ultimate guide to code generation productivity for Dart and Flutter","description":"Creating Dart and Flutter applications often includes typical tasks, such as implementing JSON deserialization, consuming backend APIs, creating a dependency inversion mechanism, implementing navigation and localization, managing assets, writing tests, and more. These tasks require writing repetitive code, which is time-consuming, error-prone, and tedious. Fortunately, we can get a significant development productivity boost by letting build_runner generate all the boilerplate. But once the project grows, extensive usage of code generation brings additional challenges, such as slower generation execution, frequent merge conflicts, analyzer performance downgrade, and others.\r\n\r\nIn this session, we will discuss how build_runner and different code-generating packages can facilitate many typical application development tasks, and also talk through a dozen practical tips for efficiently maintaining Dart and Flutter projects that extensively use code generation. I will not only show how to speed up the generation process, but also how to minimize chances for merge conflicts and improve overall developers’ experience.\r\n\r\nEven if you are familiar with code generation topic, you will certainly get valuable takeaways from this session!\r\n\r\nYou will walk away with:\r\n- An understanding of how the code generation mechanism works\r\n- A list of useful code-generating packages worth checking out\r\n- Practical advice on how to efficiently maintain projects that extensively use code generation","startsAt":"2024-07-04T10:15:00","endsAt":"2024-07-04T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"e93b6d40-2ebf-45be-aba2-2fff1fafd6fc","name":"Anna Leushchenko"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"649490","title":"Dart FFI: A Beginner's Guide to High-Performance Integration","description":"Dart is a versatile language that can be used to build a wide range of applications. However, sometimes you need the performance of another language, such as C or Rust, for certain tasks. That's where Dart FFI comes in.\r\n\r\nDart FFI allows you to call functions written in other languages directly from your Dart code. This can be a great way to boost the performance of your Dart application for specific tasks, such as image processing, numerical computing, or machine learning.\r\n\r\nWith that said, it's important to ask yourself: Is FFI always the best way to boost performance?\r\n\r\nIn this talk, we will discuss the benefits and challenges of using Dart FFI. We will also explore some alternative ways to improve the performance of your Dart application.","startsAt":"2024-07-04T10:15:00","endsAt":"2024-07-04T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8e121d12-04e2-449c-9e9d-20cd4ecec82f","name":"Matteo Maria Terzuolo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"684466","title":"Software correctness","description":"We take a break from Flutter and Dart by discussing what it means for software to be correct. Do you trust unit tests to give you the guarantees you are looking for? What does it mean for software to be actually correct? Can we give some formal guarantees about the behavior of your program?\r\n\r\nDuring this talk these questions and more will be answered. The goal of the presentation is to show examples of formal guarantees in an approachable manner. We will touch upon how to use the type system to your advantage to eliminate the mere possibility of bugs. Finally, we conclude by showing examples in the Lean theorem prover where we can prove guarantees of more complex properties.\r\n\r\nExpect some unpopular opinions and hopefully a change of perspective regarding what we call correct.","startsAt":"2024-07-04T10:15:00","endsAt":"2024-07-04T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"dc26adc3-0841-48a8-829e-bf59f104666f","name":"Marcin Wojnarowski"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"674644","title":"Creating Figma plugins with Flutter","description":"Have you ever wondered if it's possible to create a Figma plugin using Flutter?\r\n\r\nIf you are a Flutter developer and want to leverage your skills in new ways, then this session is for you.\r\n\r\nDuring this talk I'll cover:\r\n- Step-by-step guidance on setting up your development environment to integrate Flutter with Figma\r\n- How to adapt your Flutter code to run inside Figma\r\n- Running your first plugin and using Dart to manipulate Figma elements.\r\n\r\nBy the end of this session, you’ll be equipped to create your very own Figma plugins, opening up a new realm of possibilities in your development and design work. Join me to take your skills to the next level and start building unique tools that enhance how designers and developers collaborate.","startsAt":"2024-07-04T10:15:00","endsAt":"2024-07-04T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b4f481b7-c547-457b-abb5-722c771c143e","name":"Bogdan Hobeanu"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679290","title":"Implementing custom fragment shaders","description":"Flutter uses fragment shaders to enable everyday UI features like gradients and blurs. Since Flutter started supporting custom shaders, they have been incorporated into some features used in our apps today.\r\n\r\nThis talk will showcase some of these fragment shaders and explain when and why we might use custom shaders instead of the standard building blocks provided by Flutter. Additionally, the talk will include a step-by-step guide on how to implement your first custom fragment shader.\r\n\r\nFinally, we'll showcase multiple demos that highlight the powerful effects you can achieve with custom shaders.","startsAt":"2024-07-04T11:10:00","endsAt":"2024-07-04T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"cae62422-4040-4130-b345-29c8cd65f41b","name":"Raouf Rahiche"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679573","title":"Building Real-Time Audio/Video Apps with Flutter and WebRTC","description":"## Summary:\r\nThis workshop will guide participants through the process of developing real-time audio and video communication applications using Flutter and WebRTC. It covers from the basic to advanced concepts across various platforms including iOS, Android, Web, and desktop environments (Linux, Windows, macOS). Attendees will gain hands-on experience and a deep understanding of integrating real-time communication technologies seamlessly across platforms.\r\n\r\n## Session Details:\r\n### 1. **WebRTC Fundamentals and Cross-Platform Integration**:\r\n   - Detailed explanation of WebRTC components such as STUN/TURN servers, ICE, Signaling, and SDP.\r\n   - Discussion on how to implement these components within a Flutter environment across different platforms.\r\n   - Overview of different communication architectures: P2P, SFU, and MCU:\r\n     - **P2P (Peer-to-Peer)**: Direct communication between two clients, suitable for small, low-latency interactions.\r\n     - **SFU (Selective Forwarding Unit)**: Intermediate server that receives multiple media streams and decides which to send to each participant, optimizing bandwidth and scalability for larger groups.\r\n     - **MCU (Multipoint Control Unit)**: Server that mixes multiple media streams into a single stream before sending it to participants, used for large-scale broadcasts where all receive the same feed.\r\n\r\n### 2. **Platform-Specific Integration Techniques**:\r\n   - For iOS: Integrating CallKit and PushKit for enhanced communication experiences.\r\n   - For Android: Utilizing ConnectionService API and FCM to manage incoming communication effectively.\r\n   - For Web and Desktop: Addressing specific challenges and implementing notifications and background operations.\r\n\r\n### 3. **Practical Demonstration and Interactive Learning**:\r\n   - Step-by-step building of a WhatsApp clone using `cloud_firestore` for signaling and `flutter_webrtc` for media transport.\r\n   - Interactive quizzes to reinforce learning and validate understanding at each key stage of the application build.\r\n\r\n### 4. **Production Services and Pricing Models**:\r\n   - Comparison of major production-ready WebRTC services such as Agora, LiveKit, and Sora.\r\n   - Analysis of their features, benefits, and cost structures suitable from startups to enterprise-level implementations.\r\n\r\n### 5. **Implementing Comprehensive Testing Strategies**:\r\n   - Demonstrating how to set up unit, widget, and integration tests within a Flutter project.\r\n   - Exploring best practices for ensuring the quality and reliability of real-time communication apps.\r\n\r\n## Key Learning Outcomes:\r\n1. **Comprehensive understanding of WebRTC and its application in Flutter across different platforms**.\r\n2. **Skills to implement advanced audio and video calling features**.\r\n3. **Ability to select and manage cost-effective production services for scaling real-time communication applications**.\r\n4. **Enhanced problem-solving and application testing skills through interactive and practical learning approaches**.\r\n5. **Insight into securing communication applications and ensuring privacy compliance**.","startsAt":"2024-07-04T11:10:00","endsAt":"2024-07-04T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d5f710c8-1da7-4806-9566-c484d1fa5ca8","name":"Masahiro Aoki"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679728","title":"Digital transformation of media industry with Flutter","description":"In this Rebel story, we'll explore the valuable lessons we've learned over our 17-year history of developing digital services and applications, with a special focus on our 6 years of experience with Flutter. During this time, we've created multiplatform and highly scalable end-to-end services for globally recognized brands like Netflix, Burger King, and Schaeffler.\r\n\r\nWe will dive deep into the KSML case study, illustrating how Rebel, using Flutter and the Flutter News Toolkit, digitally transformed the business of a major media company.\r\n\r\nBy the end of this story, you'll gain a comprehensive understanding of the strategic decisions big companies make when investing in Flutter applications, and why we at Rebel recommend Flutter in 9 out of 10 application cases.","startsAt":"2024-07-04T11:10:00","endsAt":"2024-07-04T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8d1dcfec-8a54-4a8e-bb77-c69b792772aa","name":"Toni Piirainen"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679357","title":"White labelling apps - a year later","description":"For the past year, Danielle has been working towards a completely configurable version of her company's Mortgage Application Flutter web app. In this talk, she will show examples taken from real code how this has been accomplished including\r\n\r\n1. The range of things being configured including images, typography, and even product content and program flow\r\n\r\n2. How JSON can be used to serialize everything including examples of difficult to achieve behavior like callback methods.\r\n\r\n3. The hard lessons learned during the journey to reach this milestone\r\n\r\n4. How testing can leverage this configuration approach","startsAt":"2024-07-04T11:10:00","endsAt":"2024-07-04T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"c1e95623-0c26-4e92-af69-d83d1efb0b9b","name":"Danielle Cox"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"637305","title":"Building Your Very Own DevTools Extension","description":"We all know about the DevTools, but what if you could tailor those tools to fit your exact needs? In this talk, I'll guide you through the process of building a custom DevTools extension.\r\n\r\nWe'll start with the basics of DevTools extensions, discuss the architecture, and then develop a custom feature.\r\n\r\nBy the end, you'll have the knowledge to create your own extensions in no time!","startsAt":"2024-07-04T12:05:00","endsAt":"2024-07-04T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"aa6e824e-9c41-4fe2-ab9c-de3bee53ba6a","name":"Enzo Conty"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680962","title":"The quest to display widget markers on a map","description":"The tenth most upvoted issue in the Flutter repository is  \"[google_maps_flutter] Support Widgets as markers\", which has been open since 2018.\r\n\r\nThis issue is not exclusive to Google Maps, but also affects Mapbox and MapLibre.\r\n\r\nWhy is displaying a widget on a map so challenging? What factors make it nearly impossible?\r\n\r\nLet's find out together.\r\n\r\nThis presentation will offer a concise overview of a map rendering engine's operation and limitations. Through live demos and practical examples, this talk aims to equip developers with the knowledge and tools needed to display almost any Flutter widget on a map.","startsAt":"2024-07-04T12:05:00","endsAt":"2024-07-04T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"8fa1280c-7846-4288-87c2-c4dfc22e319a","name":"Matthieu Pernelle"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"646515","title":"The Unique Role of a Flutter Competence Lead in a Scaling Company","description":"Unlike traditional team lead roles that focus on project management and team performance, the competence leads at Wolt are at the forefront of how engineers should be hired and how things should be built within their areas of technological ownership. Their chosen weapons are tech recruiting, active knowledge sharing, and codifying best practices. Using Wolt's journey as a case study, this talk offers insights into the critical role of a Flutter Competence Lead in a scaling tech company towards stable, efficient, and modern engineering with Flutter. \r\n\r\nIn this talk, the participants will gain a holistic understanding of the Flutter Competence Lead role at Wolt, focusing on three pivotal aspects: hiring, internal knowledge sharing, and external activities. Firstly, the talk will explore tech recruitment activities that include ensuring a robust interviewer pool and planning the tech interview around the take-home assignment. Secondly, effective methods for driving internal knowledge sharing and keeping up with the evolving best practices will be discussed. Lastly, the talk will highlight the impact of our efforts in promoting engineering excellence externally through blog posts, meetups, and open-source projects. The talk aims to equip participants with practical knowledge and insights that can be applied to enhance their Flutter teams' development and operational efficiency.","startsAt":"2024-07-04T12:05:00","endsAt":"2024-07-04T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"2a1f1548-349c-48fd-924d-c0fe6081e3df","name":"Cagatay Ulusoy"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678740","title":"Fight, Flight, or Fix? Winning the Legacy Flutter Challenge","description":"Legacy code can be a major challenge for teams inheriting outdated Flutter projects. In this session, we'll dive into effective strategies for managing and refactoring legacy Dart and Flutter codebases, with a focus on team leadership, business needs, and evolving project requirements. Drawing from real-world experiences, I'll share key insights on identifying critical areas, engaging with clients, understanding business objectives, and integrating new functionalities into existing projects\r\n\r\nKey Takeaways:\r\n\r\n- Prioritize Critical Areas: Identify the most pressing issues in your legacy codebase for maximum impact.\r\n- Communicate with Clients: Foster open communication to ensure alignment with business needs.\r\n- Balance Maintenance & Development: Strike a sustainable approach to legacy code revitalization.\r\n- Practical Tools and Techniques: Gain insights into useful tools and best practices to streamline your journey with legacy code in Flutter.\r\n- Strategies for Refactoring: Learn proven methods to refactor legacy Dart code while minimizing risk and maintaining functionality.\r\n- Write Maintainable Code: Adopt best practices to prevent future legacy issues.\r\n\r\n\r\nJoin this session and learn from a team leader's firsthand experience, empowering you to transform your legacy Flutter project from a battleground into a success story.","startsAt":"2024-07-04T12:05:00","endsAt":"2024-07-04T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"108411c5-4458-42f3-bbb2-aebeaf816f38","name":"Mateusz Rus"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"659959","title":"Everything Material All At Once","description":"As Material 3 support has been enabled by default in Flutter, there have been many exciting Material updates. In this talk, Mike Rydstorm and Taha Tesser will talk about everything new and updated in the Flutter material library. Learn about the updated ColorScheme, adaptive material theming, button builders, Material 3 animations, and how to create custom Material 3 style widgets.","startsAt":"2024-07-04T13:25:00","endsAt":"2024-07-04T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"cd6bb5e9-e514-4d60-85dc-42dbebdf6ccb","name":"Taha Tesser"},{"id":"1c1b67b9-9039-4df6-84ef-a69e762ae6ff","name":"Mike Rydstrom"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"675688","title":"Bluetooth LE-Audio Broadcast: How to build an Auracast assistant app with Flutter","description":"The Bluetooth technology is getting a major upgrade with the introduction of the LE-Audio specification, which enables many new interesting features and use cases. One of them being Auracast broadcast audio. Auracast allows you to share your audio with others or listen to broadcast streams nearby you. This could be a television in a gym, a gate announcement at the airport or a lecture in an university. \r\n\r\nIn this talk I will show you how to build an Auracast assistant application, which can be used to connect to any Auracast compatible headphone and select the desired broadcast stream. I will provide a brief overview over the functionality of Bluetooth Low Energy and the Auracast specification. And afterwards you will learn how this can be translated into a Flutter application and what the current limitations on Android and iOS are. ","startsAt":"2024-07-04T13:25:00","endsAt":"2024-07-04T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d17a9c9f-d082-423c-9bfa-c44720acffad","name":"Eduard Siewert"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"658835","title":"Demystifying App Architecture: The LeanCode Guide","description":"At LeanCode we developed over 40 Flutter apps, spanning from huge enterprise apps to nimble startup ventures. Some were developed by a single Flutter dev, some came into light through collaborative efforts across multiple teams. Each of them was different. Each of them presented unique challenges and taught us invaluable lessons.\r\n\r\nIn this talk, we invite you to explore different approaches to architecting Flutter apps. Central to our narrative will be the concept of architectural drivers - key factors or priorities that steer our decisions about how the app is structured and designed. We'll show how we leverage our experience when approaching new projects. Drawing from our successes and failures, we'll present our current Flutter stack which enables us to craft robust, scalable, and maintainable applications. While there is no silver bullet for Flutter architecture, we can still have some sensible defaults. \r\n\r\nWhy do we use BLoC for state management? Why not Riverpod? Why do we love hooks? What do we do to avoid re-implementing the same things over and over again? Come to our talk to find out.","startsAt":"2024-07-04T13:25:00","endsAt":"2024-07-04T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"bb4092c0-3c42-4e7c-a935-d3abc10882fc","name":"Mateusz Wojtczak"},{"id":"15d3a177-f21f-4b7b-8f42-3f7694477f21","name":"Marcin Chudy"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679298","title":"Lessons learned from crafting an in-house framework with over 200 packages","description":"The growing need for efficient, cost-effective mobile app development has made frameworks like Flutter increasingly popular. In this talk, we dive into the significance of crafting a flexible and reusable framework of in-house packages that not only meets the technical demands but also offers strategic benefits, enabling rapid deployment of diverse apps while maintaining quality and reducing costs.\r\n\r\nIn our session, we take you on a journey through the development of our custom Flutter framework, designed to streamline app development for various clients, particularly in the mid-market sector. We explore the architectural choices, design principles, and practical learnings from creating a framework that serves many apps, each with distinct design and architectural needs but sharing common components. The talk dives into the specifics of our framework architecture, including how apps and packages are structured, and the challenges of engineering white-label solutions.\r\n\r\nLook forward to gaining valuable insights into the complexities of developing a scalable Flutter framework, learning from our successes and challenges to enhance your own development practices.","startsAt":"2024-07-04T13:25:00","endsAt":"2024-07-04T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b809b618-6662-4e3f-9b3c-85beaaa103cb","name":"Marina Meier"},{"id":"b1ffa664-5db1-48d6-9890-4a8557111c73","name":"Pascal Stech"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679870","title":"Self-host private pub packages","description":"Self-hosting Dart and Flutter packages isn't easy but required when sharing packages in an enterprise environment. Today, getting your own pub server running is either pricey or maintenance-intensive. Without being cautious, your solution might miss critical access policies.\r\n\r\nAs a Flutter agency, we encountered significant difficulties sharing our design system across multiple projects and clients. We needed a robust solution that could meet our needs, yet be affordable.\r\n\r\nThis talk compares existing solutions as well as our journey of hosting our own pub repository in an agency setup, even allowing us to use our own domain at almost zero cost.\r\n\r\nThis talk is not sponsored by any provider, neither promotes our own solution unless it is completely open source as part of the FlutterCommunity.","startsAt":"2024-07-04T14:20:00","endsAt":"2024-07-04T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"f117aa78-7e11-451d-b7ba-fb19ac866f31","name":"Pascal Welsch"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":265613,"name":"Flutter & Dart Ecosystem Summit"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"713307","title":"Using Rust in your next Flutter SDK","description":"When building a Flutter SDK, Dart provides powerful features and tooling to enhance the developer experience. But sometimes it is necessary to go beyond what Dart offers.\r\n\r\nIn this talk, we will cover the process of using the Rust programming language as the core of a Flutter SDK, as well as the reasons why you might want to do this. We will also go over some of the speedbumps we encountered along the way while building the Ditto Flutter SDK.\r\n\r\nNo prior experience with Rust is necessary","startsAt":"2024-07-04T14:20:00","endsAt":"2024-07-04T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"2bcb85b7-7c0b-4f9a-93f9-f15069d54f35","name":"Cameron Mcloughlin"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"644667","title":"Unleashing Flutter on embedded hardware with flutter-pi","description":"Unleash the power of Flutter for embedded devices! Join us while we explore the current state of\r\nFlutter on embedded devices, and buckle up for a crash course that starts off with the basics and\r\nramps up to native OpenGL integration with platform channels.\r\n\r\nWhat you will take away:\r\n- Get a grounding in flutter-pi.\r\n- Learn about the basics of Flutter on embedded devices.\r\n- Be equipped with the basic knowledge needed to go and experiment with flutter on embedded\r\n   devices yourself.\r\n- How to communicate with external peripherals ( Using protocols such as I2C, GPIO , PWM and\r\n   CANbus )\r\n- Be inspired to create bespoke user interfaces for embedded devices using Flutter.\r\n- Explore some more advanced techniques used in our star navigator demo.\r\n\r\n","startsAt":"2024-07-04T14:20:00","endsAt":"2024-07-04T15:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1e914e2b-5244-48ca-8f66-1e235f085f24","name":"Pieter Scholtz"},{"id":"9a493863-4176-4ad1-8ccb-dc98accb5036","name":"Hannes Winkler"},{"id":"e653bd4d-ae55-4939-adb8-11202959ae54","name":"Werner Scholtz"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240325,"name":"Workshop"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677192","title":"Presentation events - a missing piece in BLoC","description":"The BLoC library/pattern is a very popular approach to state management in the Flutter ecosystem. While it is general enough to solve most business logic problems it fails to encode a specific type of state - presentation events!\r\n\r\nPresentation events are indications of side effects or one-off occurrences. It solves common use-cases such as showing a snackbar upon a successful form submit, or a navigator redirect after a failed server request.\r\n\r\nIn this talk, you will learn how to enhance your BLoCs with presentation events, how create them, and why they solve an inherent problem present in BLoCs.","startsAt":"2024-07-04T15:30:00","endsAt":"2024-07-04T15:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"dc26adc3-0841-48a8-829e-bf59f104666f","name":"Marcin Wojnarowski"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"674907","title":"Get the most out of Flutter theming with theme extensions","description":"Flutter's Theming is pretty cool. It allows to abstract styling rules from your widgets in order to keep the implementation cleaner and to prevent code repetition, other than to make life easier when the design team decided to shake things up. \r\nBut here's the thing – when you dive into real-life projects, it can get a bit troublesome. Sometimes your project's design system is too complex to fit into the default Flutter theme object. Or maybe you design system and the Flutter theme object don’t semantically match up, making the design-to-code journey a bit of a head-scratcher. \r\n\r\nIn this session, we're going to take a deep dive into the world of Flutter theming. I will walk you through the behind the scenes, present different approaches and uncover the potential of theme extension to finally tailor your theme object to your unique design system, so that it won't need to fit into a cookie-cutter object. \r\nPlus, I'll sprinkle in some handy tips and tricks to make your styling workflow smoother than ever.","startsAt":"2024-07-04T15:30:00","endsAt":"2024-07-04T15:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"0f5515ac-c0a5-449a-ad78-2f642740a9a2","name":"Elvira Leveque"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"674265","title":"Level Up: How I Made the Top 10 Worldwide at Global Gamers Hackathon","description":"This session aims to empower and motivate attendees to participate more actively in Flutter hackathons and contests, offering guidance on getting started and refining strategies for better results.\r\n\r\nJoin me as I share insights from my journey to becoming one of the top 10 finalists at the Global Gamers Hackathon using the Flutter Casual Games Toolkit across five different platforms. This talk will provide a behind-the-scenes look at how I developed my submission, detailing the challenges I faced and discussing my strategies for time management and prioritization.\r\n\r\nKey Takeaways:\r\n\r\n1. Understand how to effectively use tools like the Flutter Casual Games Toolkit to accelerate development and enhance creativity.\r\n2. Learn strategies for planning and executing your project in coding contests and hackathons.\r\n3. Discover my personal tips and tricks that will help you optimize your chances of success.\r\n\r\nThis talk is for you if you're new to hackathons, have previously participated without achieving the results you hoped for, or are interested in game development using Flutter.","startsAt":"2024-07-04T15:30:00","endsAt":"2024-07-04T15:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"0885f668-d5a1-479a-91cf-988f2f40c3ba","name":"Ivanna Kaceviča"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"683656","title":"Flutteristas panel","description":"TBD","startsAt":"2024-07-04T16:10:00","endsAt":"2024-07-04T16:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d63cf645-9a0e-434b-bebe-4a3825755cb5","name":"Alicja Ogonowska"},{"id":"8e7913b6-fce4-419a-b862-7a1b535d1af9","name":"Manuela Sakura Rommel"},{"id":"d9cf6863-3524-4461-b5d2-ee91cc1595f2","name":"Kendi J"},{"id":"c1e95623-0c26-4e92-af69-d83d1efb0b9b","name":"Danielle Cox"},{"id":"0f5515ac-c0a5-449a-ad78-2f642740a9a2","name":"Elvira Leveque"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240326,"name":"Panel Discussion"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"674876","title":"Boost Your Blocs with Functional Programming: bloc_lens in Action","description":"BLoC is a great, scalable state management library. Still, it can fall short when it comes to handling complex objects. `bloc_lens` is a new solution to simplify accessing and modifying state in your app. Using the foundations of functional programming and inspired by Haskell, it allows you to hide the complexity of compound state by focusing on one field at a time. During the talk, you will learn the original concept behind functional lenses and how they can help simplify dealing with business logic in Dart.","startsAt":"2024-07-04T16:10:00","endsAt":"2024-07-04T16:30:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d20383fa-9671-420d-8b30-2080dca88579","name":"Piotr Rogulski"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"634370","title":"Mastering real world use cases in Flutter with GoRouter and GoRouterBuilder","description":"In this talk, I will present how you can use GoRouter and GoRouterBuilder to efficiently and performantly solve complex use cases in Flutter.\r\n\r\nGoRouter:\r\nWe will talk about the recommended way of Routing in Flutter the GoRouter package. We will use it in combination of the GoRouterBuilder to showcase some solutions to real world problems. Such as having a BottomNavigationBar, navigating to different screens and deeplinking.\r\n\r\nWho is this talk for?\r\nFlutter Developers who search for a sophisticated solutions for their routing. Developers who struggle with the naming of the router and Flutter developers who want to build for the Web.\r\n\r\nIn this talk you will learn:\r\nHow to use GoRouter and GoRouterBuilder effectively  and how to make your app navigation more efficient. In the end you should be ready to tackle real world routing scenarios in Flutter with the GoRouter package.\r\n","startsAt":"2024-07-04T16:10:00","endsAt":"2024-07-04T16:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"33c7d3ea-ba06-4461-a04b-8bcc98b53c02","name":"Max Weber"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"677190","title":"The past, present, and future of native interop","description":"Join us as we share our vision for a more seamless and efficient way to bridge the gap between Flutter and native code, empowering developers to create high-performance, feature-rich apps. We'll demonstrate how JNIgen/FFIgen simplifies native interop, discuss its potential impact on plugin development, and outline our roadmap for the future. Whether you're an app developer or a plugin developer, this talk will provide valuable insights into the evolving landscape of Flutter native interop.","startsAt":"2024-07-04T16:10:00","endsAt":"2024-07-04T16:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"6df3c6d2-29b1-4db1-b1f8-39d379aab23e","name":"Daco Harkes"},{"id":"0ff6d448-8402-4c8f-9e74-94f79cc303f6","name":"Hossein Yousefi"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680916","title":"Building Resilient Flutter Apps in the New Age of Non-Deterministic Data","description":"Building mobile applications that consume predominantly non-deterministic data pose a new and unique set of challenges. This talk will review tactics for handling non-deterministic data in order to build resilient and reliable mobile front ends. Key takeaways will include: how to optimize use of Dart Models for validation, defaults and sanitation to maintain a solid contract for data shape, type and size; how to implement good prompting and OpenAI function calls to get more deterministic data; and how to create more flexible UI widgets that can handle a broader range of content sizes. This talk will finish by taking a high level view of how the widespread availability of non-deterministic  data from APIs like OpenAI will change how we develop front ends. ","startsAt":"2024-07-05T09:20:00","endsAt":"2024-07-05T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"9750a853-78d5-43ab-918a-edff08a28ff1","name":"Acacia Pappas"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"649819","title":"DevOps for Frontend & implementation in the Chase UK App","description":"DevOps is always known and common for the backend, but it is for both Frontend and Backend development, as it is a collection of sets of tools to accelerate our daily tasks and transfer everything from manual to automation. \r\n\r\nHowever, DevOps for frontend projects is slightly different from Backend, and here in this talk, I will walk you through details of what DevOps means for frontend developers, and how to create a CI/CD pipeline that contributes to improving productively and releasing cycle in the Chase UK Application.\r\n\r\nKey takeaways:\r\n\r\n- The different types of CI/CD pipeline\r\n- Chase project design, architecture, and modularisation\r\n- Decouple services and reduce cycle dependencies \r\n- Tool configuration \r\n- Types of pipelines for integration, release, and deployment \r\n-  Application versioning and infrastructure management ","startsAt":"2024-07-05T09:20:00","endsAt":"2024-07-05T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1460b4e7-57a8-401e-b936-4e391a33810d","name":"Teresa wu"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"672930","title":"Unconference discussion 1 - Past, Present and Future of Native Interop","description":"Unconference style discussion of the  Flutter and Dart Package Ecosystem Summit. The discussion topic is the Past, Present and Future of Native Interop (JNIGen and FFIGen), following on from the talk that will be given at Fluttercon Europe on the topic on 4th July 2024.\r\nThe discussion will be facilitated by 2 moderators.","startsAt":"2024-07-05T09:20:00","endsAt":"2024-07-05T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b22adb1b-1682-44c2-a8f6-06a84aedd798","name":"Ander Dobo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":265613,"name":"Flutter & Dart Ecosystem Summit"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"647964","title":"Hacking and protection of Mobile Apps and backend APIs. Threat modeling exercise.","description":"You should attend this talk if you want to know how mobile apps & APIs are being hacked and what you need to do to protect them. We will explore large-scale attacks targeting backend APIs like botnets, fake registrations, and token hijacking. Whether you're a developer, security professional, or anyone invested in securing mobile applications, this talk equips you with practical insights and proactive measures to safeguard against evolving cyber threats. The talk is aligned with current OWASP MAS practices, focusing on architecture, resiliency, network, and storage areas. Join to stay ahead in protecting your digital assets.","startsAt":"2024-07-05T09:20:00","endsAt":"2024-07-05T10:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"1593fa96-7992-4838-84b8-131fe9156c8b","name":"Tomáš Soukal"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678746","title":"From Touch To Code: Gestures and Beyond","description":"Ever wondered how our daily interactions with touchscreens shape the apps we use? Join us as we journey from touch to code, exploring the world of Flutter's gesture recognition. In this session, we will start from the point we touch to screen - from glass to processor, and then to our code. Then we will go even deeper into the mechanics of gestures, and see how Flutter transforms simple taps and swipes into responsive app features. But we won't stop there—beyond the basics, we'll also see advanced technical details, including custom gesture handling and optimization techniques. This talk also aims to raise awareness for developers to notice our habits, both as a user & developer. We will also check a demo app to experience it.\r\n\r\n- Gaining understanding of touchscreens and Flutter's gesture recognition capabilities.\r\n- Explore advanced technical concepts, including custom gesture handling and optimization techniques.\r\n- Challenge our habitual interaction patterns and discover new ways for innovation in app development.","startsAt":"2024-07-05T10:15:00","endsAt":"2024-07-05T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"eeaa037a-c9cc-44d7-8b64-5c7e8ffd50eb","name":"Esra Kadah"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678107","title":"Palette Panorama: Mastering the power of Advance theming in Flutter","description":"Welcome to \"Palette Panorama,\" where we embark on a captivating voyage through the dynamic world of Flutter theming. In this illuminating session, we'll delve into the transformative power of the Multi-Theme Builder, unlocking new horizons for crafting captivating user interfaces. From harmonizing hues to orchestrating visual symphonies, discover how to wield the palette with finesse and precision. Join us as we unravel the secrets to creating immersive app experiences that captivate and delight users on every screen.\r\n\r\nKey Points:\r\n\r\nUnveiling the Multi-Theme Builder: Explore the rich capabilities of Flutter's Multi-Theme Builder and how it amplifies your creative palette for UI design.\r\nDynamic Theming Demystified: Learn the art of dynamic theming and discover how to seamlessly adapt your app's visual identity to user preferences.\r\nCrafting Visual Narratives: Dive into the intricacies of color theory and typography, and master the art of storytelling through design.\r\nElevating User Experience: Elevate your app's user experience with accessible design principles and inclusive theming practices.\r\nOptimizing Performance and Flexibility: Uncover strategies for optimizing performance while maintaining the flexibility to evolve your app's design over time.","startsAt":"2024-07-05T10:15:00","endsAt":"2024-07-05T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d3469e78-7d62-4945-be1f-b9b3cc4a134b","name":"Shree Bhagwat"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"672931","title":"Unconference discussion 2 - Sustainable package maintenance models","description":"Unconference style discussion on sustainable models to keep important packages that are no longer maintained alive.\r\nThe discussion will be facilitated by 2 moderators.","startsAt":"2024-07-05T10:15:00","endsAt":"2024-07-05T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b22adb1b-1682-44c2-a8f6-06a84aedd798","name":"Ander Dobo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":265613,"name":"Flutter & Dart Ecosystem Summit"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"657541","title":"Developer Diary: Journey of a payment integration","description":"This talk is meant as a fun but insightful retrospective on how we implemented (finally successful) our \"unknown\" payment provider into our app.\r\n\r\nI. It starts with the first approach which was writing a package for Android and iOS and calling the native libraries from Flutter.\r\n\r\nWhen we discovered that this caused too high maintenance costs we decided to switch to a browser-based implementation of the payment flow. Little did we know, how many quests we had to solve after this decision.\r\n\r\nII. Therefore, the second part of the talk superficially covers the topics WebViews, In-App browsers, Different In-App browser packages, Firebase Hosting, Firebase Functions, App Links / Universal Links vs. Deep links / Custom URL Schemes and peculiarities of our payment solution. ","startsAt":"2024-07-05T10:15:00","endsAt":"2024-07-05T10:55:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"60b3aebf-58e6-4e8f-befa-77627ea8e3c4","name":"Nino Handler"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678797","title":"Migrating 2+ Million Daily Users to Flutter with 50+ Engineers","description":"talabat, one of MENA's leading food delivery apps serving 2+ million daily users across 8+ countries, started to migrate from native Android and iOS to Flutter.\r\n\r\nIn this session, we’ll share insights from our journey, including our strategic add-to-app approach, the challenges we navigated, and how we empowered a team of 50+ mobile engineers during the transition.\r\n\r\nOur main goal is to help the audience learn from our mistakes like overusing dart entry points, misusages of Platform Channels, maintaining multiple Flutter Engines, challenges related to cross-platform deeplink navigation, and, most importantly, how crucial the culture that fosters education is.\r\n\r\nAdditionally, we will discuss Flutter's scalability and adaptability in large applications and how to onboard Android/iOS engineers onto Flutter while highlighting how we set clear quality standards with guidelines to provide a structured pathway that ensures the quality of our migration process.\r\n\r\nFurthermore, we will explore how to integrate Flutter into existing native Android and iOS codebases and emphasize the importance of experimentation throughout the transition, showcasing how we made data-driven decisions while ensuring our migration supports resilience and how Flutter enabled us to build SDUI solutions.\r\n\r\nFinally, attendees of this talk will learn about Flutter's enterprise viability, how its adoption strengthened our product development, the main metrics and benefits we received from the technology, and how Flutter allowed us to review our processes and practices to learn and grow, not just translate code from Swift, Kotlin, to Dart.\r\n","startsAt":"2024-07-05T11:10:00","endsAt":"2024-07-05T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"744622fb-9b57-42b0-87ab-7b7254b39ea4","name":"Csongor Vogel"},{"id":"781b9634-1651-4563-bb0b-2df681737fbb","name":"Lucas Britto"},{"id":"4f35a81e-0e84-4519-ae59-6641df7579ac","name":"Bruno Reginato"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"676382","title":"The Flutter POS: Use-cases on integrating POS Hardware on Android and Linux","description":"This session explores the integration of Flutter applications with POS hardware across multiple platforms, focusing on Android and Linux. It will address the complete setup of a POS system, including printers, barcode scanners, card payment systems, and cash accepting solutions. Attendees will learn about bridging Flutter with native platform capabilities using Flutter's foreign function interface (FFI), method channels, and event channels, and how these can be leveraged to build a comprehensive POS system that works seamlessly on both Android and Linux.\r\n\r\nThe aim of this presentation is to demonstrate how Flutter can be effectively utilized to create robust, efficient, and secure POS systems on Android and Linux, paving the way for innovative retail and service solutions. This session will provide valuable skills and knowledge for developers looking to expand their expertise in multi-platform hardware integration using Flutter.","startsAt":"2024-07-05T11:10:00","endsAt":"2024-07-05T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"a2ec8032-df85-49d6-8a2e-058ad7606227","name":"Alex Bordei"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"672932","title":"Unconference discussion 3 - Addressing package ecosystem fragmentation","description":"Unconference style discussion session on Addressing package ecosystem fragmentation: Identifying overlaps and promoting consolidation where beneficial.\r\nThe discussion will be facilitated by 2 moderators.","startsAt":"2024-07-05T11:10:00","endsAt":"2024-07-05T11:50:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"b22adb1b-1682-44c2-a8f6-06a84aedd798","name":"Ander Dobo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":265613,"name":"Flutter & Dart Ecosystem Summit"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"664359","title":"Mastering Flutter + Firebase: Architecting for Scale, Security & Savings","description":"Discover the key principles and strategies for building scalable, secure Flutter apps with Firebase, while keeping costs in check! Join us for an eye-opening session where we'll share actionable tips and best practices for architecting apps that scale without blowing up your costs. \r\n\r\nFrom clever database queries and structuring to authentication and authorization mechanisms, we'll show you how to design architectures that prioritize performance, security, and affordability. \r\n\r\nWe’re going to be looking at real-world examples, and empower you to make informed decisions for your projects. ","startsAt":"2024-07-05T11:10:00","endsAt":"2024-07-05T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"371c770a-ab0d-45a9-88e7-d6abb6f1c7e9","name":"Tomas Piaggio"},{"id":"be017795-f2ec-41c5-92d2-beb8727f921a","name":"Bettina Carrizo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240325,"name":"Workshop"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680919","title":"Building Hyper-Casual Games with Flutter","description":"As games increasingly become the most popular and lucrative category in major mobile marketplaces by day, the opportunity for developers is massive. Yet, many shy away, perceiving game development as a complex and inaccessible process.\r\n\r\nIn this talk, I will share my firsthand experiences using Flutter to create fun, engaging, and potentially addictive mobile games. You'll learn about the challenges I faced from design all the way to monetization, and the solutions that helped streamline the development process.\r\n\r\nThis talk aims to inspire developers to explore Flutter's capabilities in game development, equipping you with essential tools and insights to effectively start your own projects.","startsAt":"2024-07-05T12:05:00","endsAt":"2024-07-05T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"f46712dd-ece0-4127-b5fe-4c84eac87410","name":"Raitis Šaripo"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"658284","title":"Automating Accessibility Adoption in Flutter with Gemini AI","description":"For years, accessibility features and experiences were seen as nice to have when it came to app development. Shockingly, many developers overlook this vital aspect, inadvertently excluding a significant user base. The World Health Organization reveals that about 15% of the global population, over a billion people, live with disabilities. In a digital age, it's unjust to marginalize this substantial demographic based on abilities.\r\n\r\nThis talk emphasizes the critical role of accessibility in mobile apps. By introducing the innovative use of Gemini AI as an AI-powered code assistance tool in IDEs, we can address these issues head-on, ensuring that apps are accessible from the outset. Gemini AI serves as a game-changer, automating the detection and correction of accessibility issues in Flutter apps. This talk will empower developers to build apps that are inclusive and universally accessible, transforming the way we approach app design and development. ","startsAt":"2024-07-05T12:05:00","endsAt":"2024-07-05T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"76ce51b1-7dd4-4858-98de-0b51b3c9abcb","name":"Akanksha Singh"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"652342","title":"Internationalization (and not only)","description":"How should you prepare your Flutter app for introducing it on a global market? Is there something other than the content language and date format? Let's find out what to expect with internationalizing apps and how to do that in Flutter, along with some statistics and fun facts.","startsAt":"2024-07-05T12:05:00","endsAt":"2024-07-05T12:25:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"214642cb-5206-464c-b048-5b178ec3accd","name":"Albert Wolszon"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240323,"name":"Lightning talk"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680322","title":"Creating responsive UIs and other nuances of Flutter Web","description":"Flutter for Web is definitely less widespread than Flutter for mobile devices, but in my practice I have found it to be very powerful. Flutter Web has made reusing code between multiple platforms easier than ever and it enabled the use of a single frameworks across all the frontends of a project. This doesn't come without some nuances that developers should be aware of when building an app for the web.\r\n\r\nIn this session I will explore those nuances starting from tips on how to create a responsive UI, and then talking about web specific concepts such as SEO (or the lack of it) and dart:js. I will also touch on how to make text selectable, and on potential issues with it.\r\n\r\n\r\nThe main takeaways for the participants will be:\r\n- How to build a Responsive UI (LayoutBuilder, Wrap, Expanded, use fixed values, basic animations for UI transitions)\r\n- What is dart:js and what is dart:io -- how to conditionally import either of them\r\n- What is the state of SEO in Flutter and which are some solutions for the lack of support\r\n- Which are some issues with widgets on the web, most notably the default Text widget not being selectable","startsAt":"2024-07-05T13:25:00","endsAt":"2024-07-05T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"a9149f89-4190-4d02-9274-7f1f7dc615f8","name":"Kon Syrokostas"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679172","title":"App Architecture: Faster, Better... Simpler","description":"App architecture is intended to simplify our lives, not complicate them. Unfortunately, I've noticed that many developers, particularly newcomers, tend to overcomplicate their architectures without strong justification—simply because they've read about it in various blogs and tutorials. In this talk, I'd like to delve into why certain principles and best practices, such as SOLID, DRY, and Clean Architecture, may not always be as beneficial as they seem (especially when misunderstood), and suggest a simpler approach to mobile app architecture.\r\n\r\nAs a bonus, I'll share my experience with using the new DCM feature for analyzing code structure, which aids in implementing the aforementioned architectural approach.","startsAt":"2024-07-05T13:25:00","endsAt":"2024-07-05T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d8c0a8ad-8ec4-4c78-9281-579e1ade561b","name":"Kirill Bubochkin"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"678551","title":"Code Meets Art: Flutter for Creative Coding","description":"In this talk, I want to show you how you can blur the lines between code and art using Flutter!\r\n\r\nAfter a quick introduction into what creative coding is and how its visual feedback nature can be a great way to learn how to code, we’ll dive into the technical details on how Flutter can be used for that purpose. Starting from the custom painter and canvas API, and making our way into shaders and 3rd party tools and packages. Additionally, we will explore what it means to use algorithms to create Art and what happens when you bleed that art into user interfaces and experiences. Finally, with its cross platform capabilities and easy control over every pixel, we’ll answer the question of why use Flutter for this purpose in the first place.","startsAt":"2024-07-05T13:25:00","endsAt":"2024-07-05T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"2f098344-5408-4cb7-8a70-ac2f0058d21f","name":"Roaa Khaddam"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"642677","title":"Jaspr: Unleashing the Power of Dart for Modern Web Development","description":"A showcase and introduction to Jaspr, the web framework that lets you build modern and dynamic websites using pure Dart.\r\n\r\nLearn how you can build your next blog, landing page, portfolio site or any other website you can imagine and leverage your existing skills in Dart and Flutter. Whether you are a seasoned   developer or newcomer to Dart, this session lets you peek into the next area of Dart development – the web.\r\n","startsAt":"2024-07-05T13:25:00","endsAt":"2024-07-05T14:05:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"c5496250-97bf-4f65-9525-5be37c0f548c","name":"Kilian Schulte"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"680131","title":"Democratizing Flutter CI/CD: Build Sustainable Workflows with OpenCI","description":"## Overview\r\n\r\nCI/CD is crucial for streamlining Flutter development, but traditional platforms can be costly and create e-waste. Enter OpenCI, the world's first open-source CI/CD solution for Flutter.  This session dives into OpenCI, demonstrating how its self-hosting capabilities allow you to build your own sustainable CI/CD for almost free. I'll explore its innovative use of tart for free macOS VMs and how it streamlines workflows.\r\n\r\nOpenCI champions sustainability.  I'll discuss how it leverages second-hand hardware and open-source solutions to minimize environmental impact and reduce costs. OpenCI is built with Dart and fosters a collaborative community shaping CI/CD practices within the Flutter ecosystem.\r\n\r\n## Session Flow\r\n\r\n* **CI/CD Foundations:** A brief overview of CI/CD principles and their importance for Flutter projects.\r\n* **Introducing OpenCI:**  Core features, architecture, and how it addresses CI/CD cost barriers.\r\n* **The Power of Self-Hosting:**\r\n    *  Explain OpenCI's self-hosting capabilities and the potential for near-zero cost CI/CD.\r\n    * Discuss the types of resources suitable for self-hosting (e.g., used Mac Mini).\r\n* **Live Demo: OpenCI in Action**\r\n    *  Showcase setting up a basic CI/CD pipeline with OpenCI, focusing on the self-hosted aspect.\r\n    *  Highlight a key workflow that OpenCI automates (e.g., testing, linting, deployment).\r\n* **Real-World Success: Case Studies**\r\n    *  Discuss anonymized use cases, emphasizing self-hosted cost benefits and sustainability impact.\r\n    *  Cover different project types or team sizes using self-hosted OpenCI. \r\n* **OpenCI: Limitations & Transparency**\r\n    *  Discuss limitations of self-hosting (e.g., maintenance, potential scaling challenges).\r\n    *  Emphasize OpenCI's open-source nature and the power of community contributions. \r\n* **The Road Ahead: OpenCI's Future Trajectory**\r\n    *  Share your vision for OpenCI's development and community-focused evolution.\r\n    *  Encourage discussion and invite feedback on both the platform and self-hosting experience.\r\n\r\n## Who Should Attend\r\n\r\n* Flutter developers seeking full control and cost-effective CI/CD solutions.\r\n* Teams committed to sustainable development practices. \r\n* Developers interested in self-hosting and maximizing the benefits of open-source CI/CD.\r\n* DevOps enthusiasts interested in cutting-edge open-source CI/CD solutions. \r\n\r\n## Takeaways\r\n\r\n*  A deep understanding of OpenCI's functionality and the potential of self-hosting.\r\n*  Practical knowledge of how to set up, customize, and maintain a self-hosted OpenCI solution.\r\n*  Insight into OpenCI's impact on projects, cost savings, and sustainability.\r\n*  Knowledge of OpenCI's capabilities, limitations, and potential for improvement.\r\n*  The opportunity to join a community shaping the future of OpenCI and Flutter CI/CD.","startsAt":"2024-07-05T14:20:00","endsAt":"2024-07-05T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d5f710c8-1da7-4806-9566-c484d1fa5ca8","name":"Masahiro Aoki"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45877,"room":"Widget Way","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":false},{"questionAnswers":[],"id":"678437","title":"Handling Legacy APIs with Domain Driven Design and Reactivity","description":"After a brief introduction into Domain Driven Design, you will see how it can be utilised to protect your fresh and awesome app logic from the nasty and chaotic reality of legacy APIs\r\n- Compose your custom entities from any number of different data endpoints and keep external changes isolated\r\n- Sync external data sources between your repositories by using reactivity and keep your state up-to-date\r\n- Have confidence in the validity of your entities and access them synchronously to make rendering a breeze\r\n- Bonus: Use unit tests to develop and test domain and infrastructure layers end-to-end without being blocked by a still missing user interface\r\n","startsAt":"2024-07-05T14:20:00","endsAt":"2024-07-05T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"3b2e4ced-47f5-4fce-a4cd-fc81233b90ac","name":"Sascha Ernst"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":50144,"room":"Dart Den","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"636022","title":"Working with forms as an ecosystem","description":"Form handling is a basic thing for any application. Many of them have a login one. The flutter spreads around wide variety platforms so there are definitely a form heavy apps. For example I'm currently developing one.\r\n\r\nLogin like forms could be easily handled by built in flutter form engine. On the other side the complex forms require a bit different approach. Specialized form engines support a vide variety of use cases like complex validations, async validations, managing an array of entities, listening for control states and so on.\r\n\r\nI tested a lot of other packages for forms starting from native flutter forms through form_bloc and so on. My final candidate was reacitve_forms and I'm developing supportive packages to form the pleasant ecosystem around.\r\nThose packages are reacitve_forms_widgets(a 30+ ready to use widgets bindings) and reactive_forms_generator(codegen package which helps a lot with spawning the code)\r\n\r\nIn my talk I would like to tell people how I'm helping to create an ecosystem for the forms, explain how anyone could use the ecosystem for complex form and how it could save the time + make the code consistent, encourage people to do the opensource.","startsAt":"2024-07-05T14:20:00","endsAt":"2024-07-05T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"d02ae28b-29ca-489f-9d40-eb03780686d9","name":"Vasyl Dytsiak"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[],"sort":5}],"roomId":45878,"room":"Async Area","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true},{"questionAnswers":[],"id":"679915","title":"Relaunching DW's Connected TV Experience with Flutter","description":"DW is Germany's International Broadcaster.\r\n\r\nSince 2016 DW has had apps on major TV platforms like Samsung Tizen, LG webOS, Google TV / Android TV / Amazon Fire TV, Apple tvOS, and Roku TV. These apps were written in a diverse set of technologies, including Javascript, Java, Objective C, and Brightscript. We offer a range of on-demand programming for a worldwide audience that includes news, documentaries, cultural insights, and discussions on global issues in 30 languages. In addition, there are live channels in English, Spanish and Arabic.\r\n\r\nIn 2023, we set off to refresh our apps technically and tailor it to the needs of our audience. An important aspect was to reduce the number of code bases. We evaluated several technologies and settled on Flutter. In 2024, we have started to roll out our new app.\r\n\r\nIn this session, we take the audience on a journey into this exciting project. \r\n\r\nWe will explain how we decided on Flutter, considering platform support, our own experience building native TV apps, three spike implementations, the external support we could get, plus the potential of Flutter as a key ingredient of our future app development. \r\n\r\nStarting from a UX concept for a first product increment, we developed the technical architecture, following a Clean Architecture approach. We will give an overview of our codebase, including GraphQL interface, unit, golden, and integration tests. \r\n\r\nWe will also share our experience with the platforms where we already launched, including support for Spacial Navigation with TV remotes, and required performance optimizations. \r\n\r\nFinally, we will outline our plans, including integration into vendor content catalogues, a crucial building block for presence on modern TV platforms.\r\n\r\nKey takeaways:\r\n\r\n- How to decide on Flutter for an enterprise project for Connected TV\r\n- How to lay out your app architecture, following Clean Architecture\r\n- How to implement UX patterns for Connected TV like Spacial Navigation in Flutter\r\n- What pitfalls to expect when developing for TV ","startsAt":"2024-07-05T14:20:00","endsAt":"2024-07-05T15:00:00","isServiceSession":false,"isPlenumSession":false,"speakers":[{"id":"267549a9-3940-47ad-bf95-70dd8ff132f6","name":"Olav Schettler"},{"id":"2101a65d-fe6a-4654-b579-e021da003213","name":"Daniel Vechtel"}],"categories":[{"id":68384,"name":"Session format","categoryItems":[{"id":240324,"name":"Session"}],"sort":0},{"id":73812,"name":"Select a Track","categoryItems":[{"id":261762,"name":"Fluttercon"}],"sort":5}],"roomId":45879,"room":"Flutter Forest","liveUrl":null,"recordingUrl":null,"status":"Accepted","isInformed":true,"isConfirmed":true}]